tutorials/cfdemSolverPiso/ErgunTestCG/CFD/constant/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          couplingProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//===========================================================================//
// sub-models & settings
solveFlow true;

modelType "A"; // A or B

couplingInterval 100;

voidFractionModel divided;//centre;//

locateModel engine;//turboEngineM2M;//

meshMotionModel noMeshMotion;

regionModel allRegion;

IOModel basicIO;

probeModel off;

dataExchangeModel twoWayMPI;//twoWayM2M;//twoWayFiles;//oneWayVTK;//

averagingModel dense;//dilute;//

clockModel off;//standardClock;//

smoothingModel off;// localPSizeDiffSmoothing;// constDiffSmoothing; //

forceModels
(
    //KochHillDrag
    //BeetstraDrag
    //noDrag
    gradPForce
    viscForce
    GidaspowDrag
    //Archimedes
    //volWeightedAverage
    //totalMomentumExchange
    particleCellVolume
);

momCoupleModels
(
    implicitCouple
);

turbulenceModelType "turbulenceProperties";

//===========================================================================//
// sub-model properties

localPSizeDiffSmoothingProps
{
    lowerLimit 0.1;
    upperLimit 1e10;
    dSmoothingLength 1.5e-3;
    Csmoothing    1.0; 
}

constDiffSmoothingProps
{
    lowerLimit 0.1;
    upperLimit 1e10;
    smoothingLength 1.5e-3;
}

implicitCoupleProps
{
    velFieldName "U";
    granVelFieldName "Us";
    voidfractionFieldName "voidfraction";
}

ArchimedesProps
{
    gravityFieldName "g";
}
gradPForceProps
{
    pFieldName "p";
    voidfractionFieldName "voidfraction";
    velocityFieldName "U";
    interpolation true;
}

viscForceProps
{
    velocityFieldName "U";
    interpolation true;
}
noDragProps
{
    //noDEMForce;
    //keepCFDForce;
}
volWeightedAverageProps
{
    scalarFieldNames
    (
        voidfraction
    );
    vectorFieldNames
    (
    );
    upperThreshold 0.999;
    lowerThreshold 0;
    verbose true;
}
totalMomentumExchangeProps
{
    implicitMomExFieldName "Ksl";
    explicitMomExFieldName "none";
    fluidVelFieldName "U";
    granVelFieldName "Us";
}
GidaspowDragProps
{
    verbose true;
    velFieldName "U";
    voidfractionFieldName "voidfraction";
    granVelFieldName "Us";
    phi 1;
    //interpolation true; // this case does not like interpolation
    implDEM_;
}

KochHillDragProps
{
    velFieldName "U";
    voidfractionFieldName "voidfraction";
    //interpolation true;
    implDEM_;
    verbose true;
}

BeetstraDragProps
{
    velFieldName "U";
    voidfractionFieldName "voidfraction";
    granVelFieldName "Us";
    interpolation true;
//    useFilteredDragModel;
//    useParcelSizeDependentFilteredDrag;
    g       9.81;
    rhoP    7000.;
    rho     10.;
    nuf     1.5e-4;
    k       0.05;
    aLimit  0.0;
//    verbose true;
}

virtualMassForceProps
{
    velFieldName "U";
}

particleCellVolumeProps
{
    upperThreshold 0.999;
    lowerThreshold 0.;
    verbose true;
}

oneWayVTKProps
{
    couplingFilename "vtk_out%4.4d.vtk";
    maxNumberOfParticles 30000;
}

twoWayFilesProps
{
    maxNumberOfParticles 10100;
}

centreProps
{
    alphaMin 0.1;
}

engineProps
{
    treeSearch true;
}

dividedProps
{
    alphaMin 0.05;
    scaleUpVol 1.0;
}

twoWayMPIProps
{
    maxNumberOfParticles 10100;
    liggghtsPath "../DEM/in.liggghts_run";
}
// ************************************************************************* //
